In [5]:
import pandas as pd

In [6]:
business_results =pd.Series({"papa":4200,
                  "Arroz":4800,
                  "Huevo":5400,
                  "Carne":2200,
                  "platano":2500,
                  "Arina":3000,
                  "Tomate":5000,
                  "Papaya":7400,
                  "Limon":1800,
                  "Borojo": 4500})
print(business_results)

papa       4200
Arroz      4800
Huevo      5400
Carne      2200
platano    2500
Arina      3000
Tomate     5000
Papaya     7400
Limon      1800
Borojo     4500
dtype: int64

In [20]:
business_results_frame= pd.DataFrame({"Enero":[2000,1000,1200,3000],
                  "Febrero":[2300,1200,1300,4500],
                  "Marzo":[2400,1600,1400,6000],
                  "Abril":[1000,600,600,5500]},index=['Carne','Papa','Yuca',"platano"])
business_results_frame

         Enero  Febrero  Marzo  Abril
Carne     2000     2300   2400   1000
Papa      1000     1200   1600    600
Yuca      1200     1300   1400    600
platano   3000     4500   6000   5500

In [22]:
#Dictionary like
business_results_frame[["Febrero","Marzo"]]

         Febrero  Marzo
Carne       2300   2400
Papa        1200   1600
Yuca        1300   1400
platano     4500   6000

In [23]:
#Dictionary like
business_results_frame["Abril"]

Carne      1000
Papa        600
Yuca        600
platano    5500
Name: Abril, dtype: int64